API/Flight_WSDL/Report/Res1/Report/Data/Step2.xml

<?xml-stylesheet href="..//StServiceCallActivity.xsl" type="text/xsl"?><report><VTD_Type name="Type">HP.ST.Ext.WebServicesActivities.StServiceCallActivity</VTD_Type><VTD_Name name="Step ID">StServiceCallActivity4</VTD_Name><InputXml name="InputXml" xml="True" link="True" FileLocation="StServiceCallActivity4_InputXml_494328f4-abbd-4063-914f-bcd18264dfd5.xml">&lt;Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/"&gt;
  &lt;Body&gt;
    &lt;GetFlights xmlns="HP.SOAQ.SampleApp"&gt;
      &lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;
      &lt;ArrivalCity&gt;Portland&lt;/ArrivalCity&gt;
      &lt;FlightDate&gt;2025-12-31T00:00:00+00:00&lt;/FlightDate&gt;
    &lt;/GetFlights&gt;
  &lt;/Body&gt;
&lt;/Envelope&gt;</InputXml><Service name="Service">Flights_Service</Service><Port name="Port">FlightsServiceMethods</Port><Operation name="Operation">GetFlights</Operation><Address name="Address">http://localhost:8000/Flights_SOAP</Address><SOAPAction name="SOAPAction">HP.SOAQ.SampleApp/IFlightsSoapService/GetFlights</SOAPAction><ContentType name="ContentType">text/xml; charset=utf-8</ContentType><MessageExchangePattern name="MessageExchangePattern">Request Response</MessageExchangePattern><Full_request name="Full request" TooLong="True" link="True" FileLocation="StServiceCallActivity4_Full_request_e31329d7-a184-421d-a76a-e369fbdae829.xml">&lt;?xml version="1.0"? ... &lt;/Body&gt;
&lt;/Envelope&gt;</Full_request><InputHeader name="InputHeader">SOAPAction:	HP.SOAQ.SampleApp/IFlightsSoapService/GetFlights
Content-Type:	text/xml; charset=utf-8
Host:	localhost:8000
Content-Length:	257
Connection:	Close
</InputHeader><OutputHeader name="OutputHeader">Connection:	close
Content-Length:	3340
Content-Type:	text/xml; charset=utf-8
Date:	Mon, 12 May 2025 13:29:14 GMT
Server:	Microsoft-HTTPAPI/2.0
</OutputHeader><OutputText name="OutputText">&lt;s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"&gt;&lt;s:Body&gt;&lt;GetFlightsResponse xmlns="HP.SOAQ.SampleApp"&gt;&lt;GetFlightsResult xmlns:i="http://www.w3.org/2001/XMLSchema-instance"&gt;&lt;Flight&gt;&lt;Airline&gt;TWA&lt;/Airline&gt;&lt;ArrivalCity&gt;Portland&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;03:40 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;&lt;DepartureTime&gt;01:59 PM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;1492&lt;/FlightNumber&gt;&lt;Price&gt;145.8&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;TWA&lt;/Airline&gt;&lt;ArrivalCity&gt;Portland&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;06:04 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;&lt;DepartureTime&gt;04:23 PM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;1563&lt;/FlightNumber&gt;&lt;Price&gt;141&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;TWA&lt;/Airline&gt;&lt;ArrivalCity&gt;Portland&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;10:52 AM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;&lt;DepartureTime&gt;09:11 AM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;4320&lt;/FlightNumber&gt;&lt;Price&gt;153.4&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;TWA&lt;/Airline&gt;&lt;ArrivalCity&gt;Portland&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;04:52 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;&lt;DepartureTime&gt;03:11 PM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;4659&lt;/FlightNumber&gt;&lt;Price&gt;128.2&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;TWA&lt;/Airline&gt;&lt;ArrivalCity&gt;Portland&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;07:16 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;&lt;DepartureTime&gt;05:35 PM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;5237&lt;/FlightNumber&gt;&lt;Price&gt;149.4&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;TWA&lt;/Airline&gt;&lt;ArrivalCity&gt;Portland&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;12:04 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;&lt;DepartureTime&gt;10:23 AM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;5350&lt;/FlightNumber&gt;&lt;Price&gt;133.4&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;TWA&lt;/Airline&gt;&lt;ArrivalCity&gt;Portland&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;09:40 AM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;&lt;DepartureTime&gt;07:59 AM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;5471&lt;/FlightNumber&gt;&lt;Price&gt;135.4&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;TWA&lt;/Airline&gt;&lt;ArrivalCity&gt;Portland&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;08:28 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;&lt;DepartureTime&gt;06:47 PM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;6118&lt;/FlightNumber&gt;&lt;Price&gt;153&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;AA&lt;/Airline&gt;&lt;ArrivalCity&gt;Portland&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;11:00 AM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;&lt;DepartureTime&gt;08:00 AM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;6210&lt;/FlightNumber&gt;&lt;Price&gt;171.47&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;AA&lt;/Airline&gt;&lt;ArrivalCity&gt;Portland&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;03:48 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;&lt;DepartureTime&gt;12:48 PM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;6218&lt;/FlightNumber&gt;&lt;Price&gt;177.47&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;AA&lt;/Airline&gt;&lt;ArrivalCity&gt;Portland&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;06:12 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;&lt;DepartureTime&gt;03:12 PM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;6222&lt;/FlightNumber&gt;&lt;Price&gt;170.47&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;TWA&lt;/Airline&gt;&lt;ArrivalCity&gt;Portland&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;02:28 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;&lt;DepartureTime&gt;12:47 PM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;7563&lt;/FlightNumber&gt;&lt;Price&gt;144.6&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;TWA&lt;/Airline&gt;&lt;ArrivalCity&gt;Portland&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;01:16 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;&lt;DepartureTime&gt;11:35 AM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;9891&lt;/FlightNumber&gt;&lt;Price&gt;138.2&lt;/Price&gt;&lt;/Flight&gt;&lt;/GetFlightsResult&gt;&lt;/GetFlightsResponse&gt;&lt;/s:Body&gt;&lt;/s:Envelope&gt;</OutputText><HttpStatusCode name="HttpStatusCode">200 : OK</HttpStatusCode><OutputXml name="OutputXml" xml="True" link="True" FileLocation="StServiceCallActivity4_OutputXml_fda4c7fc-9f83-47e5-a993-2efc73f706cb.xml">&lt;s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"&gt;
  &lt;s:Body&gt;
    &lt;GetFlightsResponse xmlns="HP.SOAQ.SampleApp"&gt;
      &lt;GetFlightsResult xmlns:i="http://www.w3.org/2001/XMLSchema-instance"&gt;
        &lt;Flight&gt;
          &lt;Airline&gt;TWA&lt;/Airline&gt;
          &lt;ArrivalCity&gt;Portland&lt;/ArrivalCity&gt;
          &lt;ArrivalTime&gt;03:40 PM&lt;/ArrivalTime&gt;
          &lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;
          &lt;DepartureTime&gt;01:59 PM&lt;/DepartureTime&gt;
          &lt;FlightNumber&gt;1492&lt;/FlightNumber&gt;
          &lt;Price&gt;145.8&lt;/Price&gt;
        &lt;/Flight&gt;
        &lt;Flight&gt;
          &lt;Airline&gt;TWA&lt;/Airline&gt;
          &lt;ArrivalCity&gt;Portland&lt;/ArrivalCity&gt;
          &lt;ArrivalTime&gt;06:04 PM&lt;/ArrivalTime&gt;
          &lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;
          &lt;DepartureTime&gt;04:23 PM&lt;/DepartureTime&gt;
          &lt;FlightNumber&gt;1563&lt;/FlightNumber&gt;
          &lt;Price&gt;141&lt;/Price&gt;
        &lt;/Flight&gt;
        &lt;Flight&gt;
          &lt;Airline&gt;TWA&lt;/Airline&gt;
          &lt;ArrivalCity&gt;Portland&lt;/ArrivalCity&gt;
          &lt;ArrivalTime&gt;10:52 AM&lt;/ArrivalTime&gt;
          &lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;
          &lt;DepartureTime&gt;09:11 AM&lt;/DepartureTime&gt;
          &lt;FlightNumber&gt;4320&lt;/FlightNumber&gt;
          &lt;Price&gt;153.4&lt;/Price&gt;
        &lt;/Flight&gt;
        &lt;Flight&gt;
          &lt;Airline&gt;TWA&lt;/Airline&gt;
          &lt;ArrivalCity&gt;Portland&lt;/ArrivalCity&gt;
          &lt;ArrivalTime&gt;04:52 PM&lt;/ArrivalTime&gt;
          &lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;
          &lt;DepartureTime&gt;03:11 PM&lt;/DepartureTime&gt;
          &lt;FlightNumber&gt;4659&lt;/FlightNumber&gt;
          &lt;Price&gt;128.2&lt;/Price&gt;
        &lt;/Flight&gt;
        &lt;Flight&gt;
          &lt;Airline&gt;TWA&lt;/Airline&gt;
          &lt;ArrivalCity&gt;Portland&lt;/ArrivalCity&gt;
          &lt;ArrivalTime&gt;07:16 PM&lt;/ArrivalTime&gt;
          &lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;
          &lt;DepartureTime&gt;05:35 PM&lt;/DepartureTime&gt;
          &lt;FlightNumber&gt;5237&lt;/FlightNumber&gt;
          &lt;Price&gt;149.4&lt;/Price&gt;
        &lt;/Flight&gt;
        &lt;Flight&gt;
          &lt;Airline&gt;TWA&lt;/Airline&gt;
          &lt;ArrivalCity&gt;Portland&lt;/ArrivalCity&gt;
          &lt;ArrivalTime&gt;12:04 PM&lt;/ArrivalTime&gt;
          &lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;
          &lt;DepartureTime&gt;10:23 AM&lt;/DepartureTime&gt;
          &lt;FlightNumber&gt;5350&lt;/FlightNumber&gt;
          &lt;Price&gt;133.4&lt;/Price&gt;
        &lt;/Flight&gt;
        &lt;Flight&gt;
          &lt;Airline&gt;TWA&lt;/Airline&gt;
          &lt;ArrivalCity&gt;Portland&lt;/ArrivalCity&gt;
          &lt;ArrivalTime&gt;09:40 AM&lt;/ArrivalTime&gt;
          &lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;
          &lt;DepartureTime&gt;07:59 AM&lt;/DepartureTime&gt;
          &lt;FlightNumber&gt;5471&lt;/FlightNumber&gt;
          &lt;Price&gt;135.4&lt;/Price&gt;
        &lt;/Flight&gt;
        &lt;Flight&gt;
          &lt;Airline&gt;TWA&lt;/Airline&gt;
          &lt;ArrivalCity&gt;Portland&lt;/ArrivalCity&gt;
          &lt;ArrivalTime&gt;08:28 PM&lt;/ArrivalTime&gt;
          &lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;
          &lt;DepartureTime&gt;06:47 PM&lt;/DepartureTime&gt;
          &lt;FlightNumber&gt;6118&lt;/FlightNumber&gt;
          &lt;Price&gt;153&lt;/Price&gt;
        &lt;/Flight&gt;
        &lt;Flight&gt;
          &lt;Airline&gt;AA&lt;/Airline&gt;
          &lt;ArrivalCity&gt;Portland&lt;/ArrivalCity&gt;
          &lt;ArrivalTime&gt;11:00 AM&lt;/ArrivalTime&gt;
          &lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;
          &lt;DepartureTime&gt;08:00 AM&lt;/DepartureTime&gt;
          &lt;FlightNumber&gt;6210&lt;/FlightNumber&gt;
          &lt;Price&gt;171.47&lt;/Price&gt;
        &lt;/Flight&gt;
        &lt;Flight&gt;
          &lt;Airline&gt;AA&lt;/Airline&gt;
          &lt;ArrivalCity&gt;Portland&lt;/ArrivalCity&gt;
          &lt;ArrivalTime&gt;03:48 PM&lt;/ArrivalTime&gt;
          &lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;
          &lt;DepartureTime&gt;12:48 PM&lt;/DepartureTime&gt;
          &lt;FlightNumber&gt;6218&lt;/FlightNumber&gt;
          &lt;Price&gt;177.47&lt;/Price&gt;
        &lt;/Flight&gt;
        &lt;Flight&gt;
          &lt;Airline&gt;AA&lt;/Airline&gt;
          &lt;ArrivalCity&gt;Portland&lt;/ArrivalCity&gt;
          &lt;ArrivalTime&gt;06:12 PM&lt;/ArrivalTime&gt;
          &lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;
          &lt;DepartureTime&gt;03:12 PM&lt;/DepartureTime&gt;
          &lt;FlightNumber&gt;6222&lt;/FlightNumber&gt;
          &lt;Price&gt;170.47&lt;/Price&gt;
        &lt;/Flight&gt;
        &lt;Flight&gt;
          &lt;Airline&gt;TWA&lt;/Airline&gt;
          &lt;ArrivalCity&gt;Portland&lt;/ArrivalCity&gt;
          &lt;ArrivalTime&gt;02:28 PM&lt;/ArrivalTime&gt;
          &lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;
          &lt;DepartureTime&gt;12:47 PM&lt;/DepartureTime&gt;
          &lt;FlightNumber&gt;7563&lt;/FlightNumber&gt;
          &lt;Price&gt;144.6&lt;/Price&gt;
        &lt;/Flight&gt;
        &lt;Flight&gt;
          &lt;Airline&gt;TWA&lt;/Airline&gt;
          &lt;ArrivalCity&gt;Portland&lt;/ArrivalCity&gt;
          &lt;ArrivalTime&gt;01:16 PM&lt;/ArrivalTime&gt;
          &lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;
          &lt;DepartureTime&gt;11:35 AM&lt;/DepartureTime&gt;
          &lt;FlightNumber&gt;9891&lt;/FlightNumber&gt;
          &lt;Price&gt;138.2&lt;/Price&gt;
        &lt;/Flight&gt;
      &lt;/GetFlightsResult&gt;
    &lt;/GetFlightsResponse&gt;
  &lt;/s:Body&gt;
&lt;/s:Envelope&gt;</OutputXml><VTD_Message name="Message">Web service call performed successfully</VTD_Message><Name name="Name">'GetFlights'</Name><Comment name="Comment">''</Comment><VTD_Status name="Status">Done</VTD_Status></report>